[
  {
    "year": "2021",
    "abstract": "This paper examines the impact of reward-penalty mechanism (RPM) on the decision-making of a closed-loop supply chain (CLSC) under the framework of market segmentation. Decentralized dynamic game models are developed to obtain and compare the pricing and collecting decision of the CLSC with and without RPM. We find that: (i) RPM improves the actual collection rate and the profit of the recycler, while it decreases the prices of new and remanufactured products in market segments in response to higher consumer preferences; (ii) a higher buyback price guarantees that the manufacturer becomes more profitable when the government imposes low or high intensity of reward-penalty. Otherwise, the manufacturer should set a lower buyback price when the government imposes moderate intensity of reward-penalty; (iii) higher intensity of reward-penalty can not only effectively improve the environmental sustainability of CLSC, but also obtain higher social welfare; (iv) the mechanism that reward equals penalty is optimal, in which case the same intensity maximizes the actual collection rate as well as the profits of the manufacturer and the recycler. Our analysis discusses the parameters which have significant impacts on the pricing and collecting decision of the closed-loop supply chain and gains managerial insights that are both environmentally and economically beneficial."
  },
  {
    "year": "2021",
    "abstract": "As communication technology advances with 5G, the amount of data accumulated online is explosively increasing. From these data, valuable results are being created through data analysis technologies. Among them, artificial intelligence (AI) has shown remarkable performances in various fields and is emerging as an innovative technology. In particular, machine learning and deep learning models are evolving rapidly and are being widely deployed in practical applications. Meanwhile, behind the widespread use of these models, privacy concerns have been continuously raised. In addition, as substantial privacy invasion attacks against machine learning and deep learning models have been proposed, the importance of research on privacy-preserving AI is being emphasized. Accordingly, in the field of differential privacy, which has become a de facto standard for preserving privacy, various mechanisms have been proposed to preserve the privacy of AI models. However, it is unclear how to calibrate appropriate privacy parameters, taking into account the trade-off between a model’s utility and data privacy. Moreover, there is a lack of research that analyzes the relationship between the degree of differential privacy guarantee and privacy invasion attacks. In this paper, we investigate the resistance of differentially private AI models to substantial privacy invasion attacks according to the degree of privacy guarantee, and analyze how privacy parameters should be set to prevent the attacks while preserving the utility of the models. Specifically, we focus on generative adversarial networks (GAN), which is one of the most sophisticated AI models, and on the membership inference attack, which is the most fundamental privacy invasion attack. In the experimental evaluation, by quantifying the effectiveness of the attack based on the degree of privacy guarantee, we show that differential privacy can simultaneously preserve data privacy and the utility of models with moderate privacy bud..."
  },
  {
    "year": "2021",
    "abstract": "Malicious anchor node is a serious issue in underwater sensor networks. This problem gets compounded under sparse deployment scenario. To overcome this issue, the authors present a Compressed Sensing for Malicious node Compensation theorem (abbreviated as CS-MC Theorem) which would be applicable to underwater localization. To counter malicious node behavior, CS-MC Theorem is justified through three lemmas. For underwater acoustic propagation, a specific L1-norm minimization method is derived. It describes the condition for unique localization of target by discretizing the target search space. Malicious node is identified by inserting the anchor nodes into the discretized grid. An insertion vector concept is introduced to determine the extent of node metastasis. Derivations are performed to prove the mathematical basis of the proposed algorithm under acoustically stratified and unstratified scenarios. Numerical results establish the feasibility of CS-MC algorithm for sparse underwater acoustic sensor network."
  },
  {
    "year": "2021",
    "abstract": "The controller area network (CAN), which is still today the most used in-vehicle network, does not provide any security or authentication mechanism by design. Since current vehicles, which have numerous connectivity technologies, such as Bluetooth, Wi-Fi, and cellular radio, can be easily accessed from the exterior world, they can be easy targets of cyber-attacks. It is therefore urgently necessary to enhance vehicle security by detecting and stopping cyber-attacks. In this paper, we propose a novel unsupervised intrusion prevention system (IPS) for automotive CANs that detects and hinders attacks without modifying the architecture of the electronic control units (ECUs) or requiring information that is restricted to car manufacturers. We compare two machine learning algorithms’ ability to detect fuzzing and spoofing attacks, and evaluate which of them is most accurate with the fewest number of data bytes. The fewer data bytes required, the sooner detection can start and the sooner attacking frames can be detected. Experiment results show that our proposed detection mechanism achieves accuracy higher than 99%, F1-scores higher than 97%, and detection times shorter than80μsfor the types of attacks considered. Moreover, when compared to four state-of-the-art intrusion detection systems, it is the only solution that is capable of discarding attacking frames before damage occurs while being deployed on inexpensive Raspberry Pi. Such an inexpensive deployment is particularly desirable, as cost is one of the automotive industry’s primary concerns."
  },
  {
    "year": "2021",
    "abstract": "A critical challenge in image restoration is the presence of various types of noise. Meanwhile, noise detection is a crucial step in mixed noise removal. This paper tackles the challenge of restoring images corrupted by a mixture of additive Gaussian and multiplicative Gamma noise. In the proposed method, we integrate the noise detection process into a variational model using a dual formulation of a maximum a posteriori (MAP) estimator. The variational model consists of a novel adaptive fidelity term and a plugin-and-play regularization term. The fidelity term contains an adaptive weight that can automatically detect the noise types, levels, and pollution ways for each pixel. There is flexibility in choosing a plugin-and-play regularization term. For example, we can use a model-based regularizer or a deep learning-based regularizer. In addition, we present a splitting algorithm to minimize the proposed cost functional. This splitting technique enables us to transfer a mixed noise removing problem to several subproblems, including noise removal and detection. The noise detection process can be iteratively estimated by the proposed algorithm itself. Therefore, in the numerical experiments, the proposed model outperforms the existing Rudin-Osher-Fatemi (ROF), Aubert-Aujol (AA), BM3D, and deep learning-based single type denoiser. Experimental results show that the proposed model can remove noise more efficiently and better preserve details in images. Compared to the existing best-performing single type denoiser, on average, the improvements of PSNR values range from 0.33 dB to 0.81 dB under noise mixture ratiosα=0.4,0.6."
  },
  {
    "year": "2021",
    "abstract": "With a rapidly aging society, the Chinese pension industry has faced great pressure due to the increasing demand for elderly care and medical products. Due to the limited resources and capabilities of Chinese social organizations, which currently play an important role in elderly care, it is necessary to encourage more private enterprises to enter the pension industry and thus provide significantly more products to all elderly people. This study aimed to explore the extent to which government subsidies may incentivize private enterprises to enter the pension industry. In contrast to previous studies, the level of corporate social responsibility (CSR), social value, and service quality of an enterprise were considered in this study as factors that influence the decision of whether to enter the pension industry. By constructing a theoretical model, three different government subsidy strategies, namely, no subsidy, subsidy to enterprises, and subsidy to consumers, were analyzed, especially their impacts on the social and economic values of enterprises. Our theoretical and simulation results show that the impact of government subsidies is related to the CSR level of an enterprise. As the CSR level is relatively high, it is more effective to grant subsidies to customers than to enterprises. Moreover, by comparing the optimal price, service quality, and demand of the three subsidy strategies, we find that subsidies to enterprises and customers will lead to the highest service quality and highest market demand, respectively."
  },
  {
    "year": "2021",
    "abstract": "In this paper, an expandable non-isolated multi-input single-output DC-DC high voltage gain converter with the capability of cancelling input current ripples is proposed, which can be applied in photovoltaic (PV) systems. The proposed converter has several advantages including: 1) it provides a single voltage gain for the whole range of duty cycles; 2) the duty cycle’s operating range is not decreased when increasing the number of input stages; 3) it has a simple switching pattern, and all switches go on and off, simultaneously; 4) the current ripple of each input stage is eliminated for the whole range of duty cycles; 5) the output load has a common ground with all input voltage sources; and 6) the voltage stress on switches is low. In this paper, the proposed converter in a dual-input single-output (DISO) form is introduced at first, and its general form with multi-input single-output (MISO) is then analyzed. Following that, the voltage gain, voltage and current stresses on switches, diodes and capacitors, and input current ripple cancelling condition are calculated. Finally, experimental results are used to validate the calculated theoretical results."
  },
  {
    "year": "2021",
    "abstract": "Attacks on cryptocircuits are becoming increasingly sophisticated, requiring designers to include more and more countermeasures in the design to protect it against malicious attacks. Fault Injection Attacks and Differential Fault Analysis have proven to be very dangerous as they are able to retrieve the secret information contained in cryptocircuits. In this sense, Trivium cipher has been shown to be vulnerable to this type of attack. This paper presents four different fault detection schemes to protect Trivium stream cipher implementations against fault injection attacks and differential fault analysis. These countermeasures are based on the introduction of hardware redundancy and signature analysis to detect fault injections during encryption or decryption operations. This prevents the attacker from having access to the faulty key stream and performing differential fault analysis. In order to verify the correct operation and the effectiveness of the presented schemes, an experimental system of non-invasive active attacks using the clock signal in FPGA has been designed. This system allows to know the fault coverage for both multiple and single faults. In addition, the results of area consumption, frequency degradation, and fault detection latency for FPGA and ASIC implementations are presented. The results show that all proposed countermeasures are able to provide a fault coverage above 79% and one of them reaches a coverage of 99.99%. It has been tested that the number of cycles for fault detection is always lower than the number of cycles needed to apply the differential fault analysis reported in the literature for the Trivium cipher."
  },
  {
    "year": "2021",
    "abstract": "The digital content wave has proliferated the financial and industrial sectors. Moreover, with the rise of massive internet-of-things, and automation, technologies like augmented reality (AR) and virtual reality (VR) have emerged as prominent players to drive a range of applications. Currently, sixth-generation (6G) networks support enhanced holographic projection through terahertz (THz) bandwidths, ultra-low latency, and massive device connectivity. However, the data is exchanged between autonomous networks over untrusted channels. Thus, to ensure data security, privacy, and trust among stakeholders, blockchain (BC) opens new dimensions towards intelligent resource management, user access control, audibility, and chronology in stored transactions. Thus, the BC and 6G coalition in future AR/VR applications is an emerging investigative topic. To date, authors have proposed surveys that study the integration of BC and 6G in AR/VR in isolation, and hence a coherent survey is required. Thus, to address the gap, the survey is the first-of-its-kind to investigate and study the coalition of BC and 6G in AR/VR space. Based on the proposed research questions in the survey, a solution taxonomy is presented, and different verticals are studied in detail. Furthermore, an integrative architecture is proposed, and open issues and challenges are presented. Finally, a case study, BvTours, is presented that presents a unique survey on BC-based 6G-assisted AR/VR virtual home tour service. The survey intends to propose future resilient frameworks and architectures for different industry 4.0 verticals and would serve as starting directions for academia, industry stakeholders, and research organizations to study the coalition of BC and 6G in AR/VR in industrial applications, gaming, digital content manufacturing, and digital assets protection in greater detail."
  },
  {
    "year": "2021",
    "abstract": "Bluetooth Low Energy (BLE) is a ubiquitous low-power communication technology used in many applications including location-based services. Typically, in BLE localization, the beacons transmit advertisement messages while moving devices infer their location from radio signal strength measurements. Previous work has noted that three radio channels used for advertisement transmission exhibit different propagation conditions including frequency dependent shadowing and multipath. Because most of the consumer electronic devices report only the measured signal strength value without the number of a channel in which it was measured, the variance of the measurements increases and adversely affects the accuracy of localization. Information on the channel used can improve the localization accuracy, however, the existing approaches are limited to three advertisement channels, ignoring the remaining 37 channels available in BLE communication. This article analyses the impact of channel diversity on the accuracy of BLE-based indoor localization. In contrast to previous work, we use signal strength measurements from all 40 channels and show that channel diversity can significantly improve the localization accuracy. Experiments conducted in 100m2office area show that using signal strength measurements in 40 channels improves the average localization accuracy by approximately 50% and 20% compared to the use of 3 channels without and with information on the channel used, respectively. Overhead of the proposed method can be reduced through careful selection of the radio channels used in measurements. We propose a channel selection method which allows to significantly improve the localization accuracy using measurements collected from between 10 and 15 channels."
  },
  {
    "year": "2021",
    "abstract": "Face morphing attack detection is a challenging task. Automatic classification methods and manual inspection are realised in automatic border control gates to detect morphing attacks. Understanding how a machine learning system can detect morphed faces and the most relevant facial areas is crucial. Those relevant areas contain texture signals that allow us to separate the bona fide and the morph images. Also, it helps in the manual examination to detect a passport generated with morphed images. This paper explores features extracted from intensity, shape, texture, and proposes a feature selection stage based on the Mutual Information filter to select the most relevant and less redundant features. This selection allows us to reduce the workload and know the exact localisation of such areas to understand the morphing impact and create a robust classifier. The best results were obtained for the method based on Conditional Mutual Information and Shape features using only 500 features for FERET images and 800 features for FRGCv2 images from 1,048 features available. The eyes and nose are identified as the most critical areas to be analysed."
  },
  {
    "year": "2021",
    "abstract": "People with vision impairment use Braille language for reading, writing, and communication. The basic structure of the Braille language consists of six dots arranged in three rows and two column cells, which are identified by visually impaired people using finger touch. However, it is difficult to memorize the pattern of dots that form the Braille characters. This research presents a novel approach for automatic Braille characters recognition. The designed approach works in two main stages. In first stage, image alignment & enhancement are performed using several image preprocessing techniques. In second stage, character recognition is performed with a proposed lightweight convolution neural network (CNN). As CNN shows promise for accurate recognition of optical characters. Therefore, we adopted several recently proposed state-of-the-art CNN networks for Braille characters’ recognition. To make the networks light and improve their recognition performance, we proposed a strategy by replacing few modules in the original CNNs with an inverted residual block (IRB) module with less computational cost. The novelty of this work lies in CNN model design and output performance. We executed the effectiveness of the designed setup through experiments on two different publicly available benchmark Braille datasets obtained from visually impaired people. On the English Braille and Chinese double-sided Braille image (DSBI) datasets, the proposed model shows a prediction accuracy of 95.2% and 98.3%, respectively. The reported test time of model is about 0.01s for English and 0.03s DSBI Braille images. In comparison to state-of-the-art, designed method is robust, effective, and capable to identify the Braille characters efficiently. In future, the functional performance of the proposed Braille recognition scheme will be tested through accessible user interfaces."
  },
  {
    "year": "2021",
    "abstract": "This paper proposes a new family of discontinuous PWM strategies to control the quasi-Z-source nine-switch inverters (qZS-NSI). The presented strategies provide buck and boost inversion capabilities, and suitable for common-frequency and different-frequency modes of operation. Accordingly, two different shoot-through (ST) approaches are introduced and compared. The first approach uses three-leg ST, while the second uses single-leg ST to reduce the number of switching commutations, therefore minimizing switching losses. Both approaches can be implemented using simple-boost (SB) and maximum boost (MB) control methods. The operating principles, performance criteria, and PWM modulator of each scheme are introduced. Compared to the conventional PWM technique for the same output voltage gains, the proposed schemes ensure continuous input current with minimum ripples, and the voltage stresses on the switching devices and capacitors could be reduced in the proposed MB control schemes. Moreover, the effective switching frequency of upper and lower switches of all schemes is fixed and could be reduced by 1/3 from the switching frequency of the conventional technique of the qZS-NSI, while only the single-leg ST schemes ensure minimum effective switching frequency of the middle switches. The proposed modulation strategies are digitally implemented and tested on the LAUNCHXL-F28379D DSP. The feasibility of the proposed modulation schemes is confirmed via simulation and experimental results, which show good agreement with the theoretical analysis. Moreover, the presented strategies can be applied to other types of Z-source NSIs."
  },
  {
    "year": "2021",
    "abstract": "ACMs have been demonstrated to be highly suitable as image segmentation models for computer vision tasks. Among other ACM, the local region-based models show better performance because they extract the local information regarding intensity in the neighborhood and embed it into the energy minimization function to guide the active contour to the boundary of the desired object. However, the online segmentation of noisy and inhomogeneous is still a challenging task for local region-based ACM models. To overcome this challenge, the paper proposes a novel region-based active contour model, named active contour model with local dilated convolution filter (ACLD). The ACLD integrates local image information in the form of a signed pressure force function. Then, a Gaussian kernel is applied using dilated convolution instead of discrete convolution for regularizing the level set formulation. Finally, instead of using a constant stopping condition, the ACLD automatically stops at the object boundaries. The proposed model shows improved image segmentation results visually combined with less computational time in the case of synthetic and natural images compared with the state-of-the-art models. Further, on the ISIC2017 dataset, the ACLD yields segmentation results with the highest accuracy."
  },
  {
    "year": "2021",
    "abstract": "The most competitive heuristics for calculating the median string are those that use perturbation-based iterative algorithms. Given the complexity of this problem, which under many formulations is NP-hard, the computational cost involved in the exact solution is not affordable. In this work, the heuristic algorithms that solve this problem are addressed, emphasizing its initialization and the policy to order possible editing operations. Both factors have a significant weight in the solution of this problem. Initial string selection influences the algorithm’s speed of convergence, as does the criterion chosen to select the modification to be made in each iteration of the algorithm. To obtain the initial string, we use the median of a subset of the original dataset; to obtain this subset, we employ the Half Space Proximal (HSP) test to the median of the dataset. This test provides sufficient diversity within the members of the subset while at the same time fulfilling the centrality criterion. Similarly, we provide an analysis of the stop condition of the algorithm, improving its performance without substantially damaging the quality of the solution. To analyze the results of our experiments, we computed the execution time of each proposed modification of the algorithms, the number of computed editing distances, and the quality of the solution obtained. With these experiments, we empirically validated our proposal."
  },
  {
    "year": "2021",
    "abstract": "Common gait deviations in cerebral palsy can be divided into spastic hemiplegia and spastic diplegia gait patterns. These gait deviations require the use of a large amount of data obtained by clinical gait analysis through video, kinematic, kinetic, electromyographic sensors, and plantar pressure data to assess patient gait characteristics. In this paper, we use predictive forward dynamics to investigate the effects of the biarticular hamstrings (HAMS), gastrocnemius (GAS) and biceps femoris short head (BFSH) on the knee joint in gait cycle. We attempted to explore the characteristics for reproducing the patient’s gait by modifying the parameters of model muscles. We applied mild, moderate and severe muscle weakness or contracture to the HAMS, GAS and BFSH muscle groups, respectively, and trained the model to walk at a self-selected speed, showing that with the more severe contracture, the non-swinging phase presented more severe knee hyperflexion and stronger knee torque, and the sensitivity for change is ranked by GAS>BFSH>HAMS. In swing phase, HAMS and GAS contractures aggravate the knee angle, whereas contractures of BFSH have a weak effect on knee angle. Mild HAMS muscle weakness accelerated walking speed, while moderate and severe HAMS muscle weakness hindered walking speed instead. BFSH muscle weakness is more sensitive to knee joint torque. Finally, a variable parameter impedance controller for the lower limb exoskeleton rehabilitation robot is developed. We apply the knee joint angle and torque parameters optimized by predictive forward dynamics simulation as the expected values for the robot to achieve customized tuning of the motion trajectory for the exoskeleton rehabilitation robot and meet the different rehabilitation stages."
  },
  {
    "year": "2021",
    "abstract": "Contention is the main problem in optical burst switching (OBS) systems that lead to loss more burst by dropping the contended burst. To deal with this problem, we propose a new proactive method which is based on the integration of Real-Time Scheduling Techniques: Earliest-deadline-first (EDF) and round-robin (RR). Based on this consideration, this paper proposes a series of novel coherent interdependence methods to propose a novel OBS edge node Architecture: (i) An adaptive priority system to obtain QoS guarantees, (ii) Admission control and bandwidth distribution to maximize the link throughput. The proposed technique classifies the incoming data packets into two categories: granted service (GS) for high priority and best effort (BE) for low priority. The RR technique is used for scheduling different BE and GS packets when they have the same deadlines while the EDF is used to manage GS packets with different deadlines. In addition, the admission and bandwidth assignment policies vary in function of traffic characteristics. For GS traffic, only the bandwidth used is needed, while the remaining bandwidth is assigned to best effort traffic. With the EDF and RR scheduling algorithms, the proposed edge node design obtains a brand new architecture. The proposed OBS architecture has been tested for dynamic traffic in which both BE and GS traffic arrives according to a Poisson distribution for different scenarios based on traffic distribution and switch resources reservation. In scenario#1, 90% GS traffic and 10% BE traffic and reserve 7% of the switch resources for BE traffic are considered. Therefore, the proposed architecture provides a higher grade of service to the end-users with the guaranteed service level of agreements than the existing architecture that does not implement resource reservation protocols. In addition, the modified OBS-edge node is designed and implemented on FPGA Virtex-11C2V40. The hardware performance analysis shows that the network dimension is ..."
  },
  {
    "year": "2021",
    "abstract": "Constant rotor system monitoring enables timely control and maintenance actions that decrease the likelihood of severe malfunctions and end product quality deficits. Soft sensors represent a promising branch of solutions enhancing rotor system monitoring. A soft sensor can substitute a malfunctioning physical sensor and provide estimates of a quantity that is difficult to measure. This research demonstrates a soft sensor based on bidirectional long short-term memory (LSTM), and a training procedure for rotor system monitoring at high sampling frequency and varied operating conditions. This study adopts a large rotor and bearing vibration dataset. The soft sensor accurately estimates lateral displacement trajectories of the rotor from the bearing reaction forces over a large range of constant rotating speeds and constant support stiffnesses. The mean absolute error (MAE) of the LSTM-based soft sensor is 0.0063 mm over the test trajectories in the complete operating condition space. The soft sensor performance is shown to decrease significantly to a MAE of 0.0442 mm, if the training dataset is limited in the rotating speed range."
  },
  {
    "year": "2021",
    "abstract": "This work presents a method for summarizing scientific articles from the arXive and PubMed datasets using a greedy Extractive Summarization algorithm. We used the approach along with Variable Neighborhood Search (VNS) to learn what is the top-line exists in the area of Extractive Text Summarization quality in terms of ROUGE scores. The algorithm is based on first selecting for the summary the sentences from the text containing the maximum number of words with the higher TFIDF values along with minimum document frequency parameter tuning for TFIDF vectorization. As a result, the method achieves 0.43/0.12 and 0.40/0.13 for ROUGE-1/ROUGE-2 scores on arXive and PubMed datasets, respectively. These results are comparable to the state-of-the-art models using complex neural network architectures and serious computational resources together with the large amounts of training data. In contrast, our method uses a straightforward statistical inference methodology."
  },
  {
    "year": "2021",
    "abstract": "Educational digital storytelling is widely recognised as a powerful approach in developing literary skills, experiencing problem-solving and computational thinking, information and knowledge visualisation, building creativity and divergent thinking supported by technological solutions. However, educators feel that they miss opportunities, skills, and tools to support pupils developing creativity. Hence, we proposed a digital learning environment, named Novelette, to support both educators and learners in performing visual storytelling by scaffolding them in inventing and authoring stories. The main novelty of our approach lies in embedding literary artifices widely explored in learning settings into a digital learning environment, such as the opportunity to continue someone else’s story and the suggestion mechanism to explore analogies or synonyms starting from a word of interest. Novelette has been ideated not only as a learning environment for educators, but with educators, as it results from a user-centered and participatory design methodology to involve them in the entire design and development process actively. This paper focuses on the assessment of Novelette usability according to both educators and pupils. As a conclusive step of the co-design approach, developers tested the resulting usability according to educators in a controlled environment. Moreover, it reports usability according to learners in real settings at school. Results demonstrate that Novelette is considered usable by both target groups, and it is perceived as a powerful approach in developing creativity both according to quantitative insight offered by the System Usability Scale, a.k.a., SUS, and qualitative interpretations enabled with direct observations and structured after scenario questionnaires. We can conclude that Novelette is a pleasant and usable tool to invent and author stories and seems to be a promising approach to develop creativity."
  },
  {
    "year": "2021",
    "abstract": "In times of climate change, growing world population, and the resulting scarcity of resources, efficient and economical usage of agricultural land is increasingly important and challenging at the same time. To avoid disadvantages of monocropping for soil and environment, it is advisable to practice intercropping of various plant species whenever possible. However, intercropping is challenging as it requires a balanced planting schedule due to individual cultivation time frames. Maintaining a continuous harvest throughout the season is important as it reduces logistical costs and related greenhouse gas emissions, and can also help to reduce food waste. Motivated by the prevention of food waste, this work proposes a flexible optimization method for a full harvest season of large crop ensembles that complies with given economical and environmental constraints. Our approach applies evolutionary algorithms and we further combine our evolution strategy with a sophisticated hierarchical loss function and adaptive mutation rate. We thus transfer the multi-objective into a pseudo-single-objective optimization problem, for which we obtain faster and better solutions than those of conventional approaches."
  },
  {
    "year": "2021",
    "abstract": "This work proposes a Self-Competence Learning bandwidth slicing method (SCL) to determine the quantity and position of each slice’s spectrum resources considering the channel diversity and varying bandwidth requirements. SCL obtains high throughput in the following aspects: (1) SCL provides artificial intelligence (AI) based functionality to determine the quantity and position of the spectrum resource, (2) SCL can be trained solely by self-competence without any assistance or labeling by manual operations, and (3) SCL provides confidentiality without compromising on training performance in a collaborative learning environment. Simulation results demonstrate SCL improves the 10% overall throughput and saves up 25% bandwidth resource for AI model merging."
  },
  {
    "year": "2021",
    "abstract": "Model-predictive-controller (MPC), one of the optimal control policies, has gained more attention in servo drive and other industrial applications in recent years due to evident control performance benefits compared to more classical control methods. However, an MPC algorithm solves a constrained optimization problem at each step that brings a substantial computational burden over classical control policies. This study focuses on improving the computational efficiency of an online MPC algorithm and then demonstrates its practical feasibility on the field weakening operation in high-speed PMSM control applications where the sampling frequency is in the order ofμs. We implement the existing dual active set solver by replacing two standard methods in the matrix update step to reduce the overall computational cost of the algorithm. We also rearrange the linear approximation for the constraints on voltage and current by taking the tradeoff between accuracy and speed into account. We finally verify the efficiency and effectiveness of the proposed structure via processor-in-the-loop simulations and physical platform experiments."
  },
  {
    "year": "2021",
    "abstract": "In the above article [1], the following author bios must be updated as their posts and positions were upgraded, and the profile picture of Bassem F. Felemban was previously incorrect."
  },
  {
    "year": "2021",
    "abstract": "Walking is a human need. Even when physical disabilities or social situations, such as the COVID-19 pandemic, prevent people from walking, virtual reality can provide an opportunity for virtual walking or travel. In this study, a virtual walking system was developed in which users view omnidirectional movies while receiving scene-congruent vibrations to their left and right forefeet and heels. The timings of foot vibrations were generated by estimating the camera motion trajectory with visual simultaneous localization and mapping (visual SLAM) applied to four omnidirectional movies. Congruent vibration patterns were prepared for four ground scenes. Modulation of walking-related sensations and ground material perceptions by congruent and incongruent vibrations was verified using psychological measurements. The results showed that rhythmic foot vibration improved the sensations of self-motion, walking, leg action, and telepresence irrespective of scene–vibration congruency. Moreover, congruent vibrations were better than incongruent vibrations for walking-related sensations and telepresence in indoor corridors and snowy ground scenes. The perception of ground materials was enhanced by scene-congruent vibrations, whereas it was confused by scene-incongruent vibrations. These findings suggest that vibration patterns do not necessarily need to match the ground exactly to induce virtual walking sensations; however, scene-congruent or similar vibrations improve virtual walking sensations and ground material perception. By applying our methods, we can convert various public omnidirectional movies into realistic virtual walking experiences."
  },
  {
    "year": "2021",
    "abstract": "The discrete time Lyapunov equation is used in many applications and there is interest in its inverse and direct solutions. New methods are proposed to obtain solutions for cases where the system matrix is in controllable canonical form. The approach is based on the relationship between the discrete Lyapunov equation and the entries of one of the stability tables presented by Jury. It is shown that the inverse solution, which is based on this stability table, can be obtained usingLDLtdecomposition. Also the direct solution of the discrete Lyapunov equation can be obtained directly from the entries of this stability table. The proposed algorithms are illustrated by numerical examples."
  },
  {
    "year": "2021",
    "abstract": "In recent decades, agricultural goods demand has grown exponentially due to the growth of the human population. Agricultural production demands new and simple techniques. Moreover, safe, efficient, and cost-effective methods are required for monitoring agriculture crops. This research aims to provide a simple image processing technique that detects and distinguishes the object (agricultural goods) in drone-based agrarian imagery. We used cotton crop images as experimental data in this research due to its different spectral characteristics according to drone camera sensors, minimum weather constraints, and flight schedule timing-related constraints. The proposed method used fuzzy reasoning-based tactics combined with RGB and HSV color spaces by manipulating image color pixel values and setting the upper/lower limits values of the colors for detection and distinguishing the agricultural objects such as white cotton bolls from the rest of the image."
  },
  {
    "year": "2021",
    "abstract": "Industrial wireless channels feature rich multipath components and strong noise. Massively deployed nodes in an industrial network are often cheap devices. Under such circumstances, the received packets are prone to errors. The conventional method for guaranteeing data quality relies on the MAC layer approach, such as retransmissions. However, this approach creates a data misalignment problem that degrades the performance of multidevice cooperation. Therefore, we propose a robust quadrature ergodic chaotic parameter modulation (QECPM)-based receiver to avoid retransmission. The proposed method does not require timing synchronization. This method eliminates the possibility of cycle slipping, which has a major effect on performance. The bit error rate (BER) performance of the proposed receiver in the Nakagami-m channel is derived and verified by simulation. Using the proposed receiver, the multipath effect can be mitigated using a single scalar. We use software-defined radios (SDRs) to show that the proposed method is robust against timing synchronization errors in practice. Furthermore, we show that as long as there are retransmissions, misaligned packets are to be expected; however, when using the proposed receiver, the error bits are sparse enough to utilize the non-retransmission mode to maintain stable link rates. Our results show that the proposed receiver is robust to multipath, timing synchronization errors and data misalignment."
  },
  {
    "year": "2021",
    "abstract": "In this article, a novel and simple design approach of millimeter-wave (mm-wave) low side- and back-lobe substrate integrated waveguide (SIW) filtenna array is investigated by using predefined filtering power divider (FPD). The FPD consists of two coupled SIW cavities operating at TE101and TE301modes, respectively. The TE301mode divides the energy from Cavity 1 into three parts equally and three outputs are loaded to Cavity 2 for power distribution, making the FPD design simplified. Based on this, the predefined power splitting ratio (1:1:1 and 1:3:1) of the FPDs can be obtained easily by controlling the output external quality factor (Qe). Accordingly, the side and back lobes of the filtenna array are suppressed by using the proposed FPD with predefined power splitting ratio of 1:3:1. To verify the proposed approach, a3×3filtenna array prototype centered at 27.2 GHz is designed, fabricated and measured. The measured results show an impedance bandwidth (|S11|<−10dB) of 1.8 %. The filtenna array performs good gain-passband selectivity with an in-band peak gain of 11.1 dBi, and the side lobe is suppressed more than 20 dB while the front-to-back ratio is over 30 dB. Good agreement is achieved between simulated and measured results."
  },
  {
    "year": "2021",
    "abstract": "There are many problems in cellular communications cannot be resolved traditionally. The quantum communications can add new dimensions, safety, encryption and solution to the traditional networks because of its robust physical strength. However, it is not entirely realised how to adapt the quantum into the traditional communications because it is not entirely utilised. This paper addresses the necessary guidelines and assessments for future quantum solutions to the standard mobile cloud networks. In particular, using entanglement phenomenon to increase the performance of the X2 application (X2-AP) protocol by minimising the overhead signalling, represented by the time and energy consumption the conventional cloud encounters. We intended to offer a delay reduction while adapting the quantum technique into the cloud by modelling the latency of both paradigms. Finally, increasing the number of photons has decreased the delay to about 40% compared to the traditional network. In addition, the energy efficiency in the quantum case has been increased while decreasing the power consumption by about 10%."
  },
  {
    "year": "2021",
    "abstract": "More than a quarter of all Americans are estimated to have multiple chronic conditions (MCC). It is known that shared modifiable lifestyle behaviors account for many common MCC. What is not precisely known is the dynamic effect of changes in lifestyle behaviors on the trajectories of MCC emergence. This paper proposes dynamic functional continuous time Bayesian networks to effectively formulate the dynamic effect of patients’ modifiable lifestyle behaviors and their interaction with non-modifiable demographics and preexisting conditions on the emergence of MCC. The proposed method considers the parameters of the conditional dependencies of MCC as a nonlinear state-space model and develops an extended Kalman filter to capture the dynamics of the modifiable risk factors on the MCC evolution. It also develops a tensor-based control chart based on the integration of multilinear principal component analysis and multivariate exponentially weighted moving average chart to monitor the effect of changes in the modifiable risk factors on the risk of new MCC. We validate the proposed method based on a combination of simulation and a real dataset of 385 patients from the Cameron County Hispanic Cohort. The dataset examines the emergence of 5 chronic conditions (Diabetes, Obesity, Cognitive Impairment, Hyperlipidemia, Hypertension) based on 4 modifiable lifestyle behaviors representing (Diet, Exercise, Smoking Habits, Drinking Habits) and 3 non-modifiable demographic risk factors (Age, Gender, Education). For the simulated study, the proposed algorithm shows a run-length of 4 samples (4 months) to identify behavioral changes with significant impacts on the risk of new MCC. For the real data study, the proposed algorithm shows a run-length of one sample (one year) to identify behavioral changes with significant impacts on the risk of new MCC. The results demonstrate the sensitivity of the proposed methodology for dynamic prediction and monitoring of the risk of MCC emergence in i..."
  },
  {
    "year": "2021",
    "abstract": "Deep learning has become one of the most popular research topics today. Researchers have developed cutting-edge learning algorithms and frameworks around deep learning, applying them to a wide range of fields to solve real-world problems. However, we are more concerned about the security risks associated with deep learning models, such as adversarial attacks, which this article will discuss. Attackers can use the deep learning model to create the conditions for an attack, maliciously manipulating the input images to deceive the classification model and produce false positives. This paper proposes a method of pre-denoising all input images to prevent adversarial attacks by adding a purification layer before the classification model. The method in this paper is proposed based on the basic architecture of Conditional Generative Adversarial Networks. It adds the image perception loss to the original algorithm Pix2pix to achieve more efficient image recovery. Our method can recover noise-attacked images to a level close to the actual image to ensure the correctness of the classification results. Experimental results show that our approach can quickly recover noisy images, and the recovery accuracy is 20.22% higher than the previous state-of-the-art."
  },
  {
    "year": "2021",
    "abstract": "Nowadays, most applications hosted on public cloud data centers (DCs) disseminate data from a single source to a group of receivers for service deployment, data replication, software upgrade, etc. For such one-to-many data communication paradigm, multicast routing is the natural choice as it reduces network traffic and improves application throughput. Unfortunately, recent approaches adopting IP multicast routing suffer from scalability and load balancing issues, and do not scale well with the number of supported multicast groups when used for cloud DC networks. Furthermore, IP multicast does not exploit the topological properties of DCs, such as the presence of multiple parallel paths between end hosts. Despite the recent efforts aimed at addressing these challenges, there is still a need for multicast routing protocol designs that are both scalable and load-balancing aware. This paper proposesErnie, a scalable load-balanced multicast source routing for large-scale DCs. At its heart,Erniefurther exploits DC network structural properties and switch programmability capabilities to encode and organize multicast group information inside packets in a way that minimizes downstream header sizes significantly, thereby reducing overall network traffic. Additionally,Ernieintroduces an efficient load balancing strategy, where multicast traffic is adequately distributed at downstream layers. To study the effectiveness ofErnie, we extensively evaluateErnie’s scalability behavior (i.e., switch memory, packet size overheads, and CPU overheads), and load balancing ability through a mix of simulation and analysis of its performances. For example, experiments of large-scale DCs with 27k+ servers show thatErnierequires a downstream header sizes that are10×smaller than those needed under state-of-the-art schemes while keeping end-host overheads at low levels. Our simulation results..."
  },
  {
    "year": "2021",
    "abstract": "Convolutional neural networks (CNNs) have gained a huge attention for real-world artificial intelligence (AI) applications such as image classification and object detection. On the other hand, for better accuracy, the size of the CNNs’ parameters (weights) has been increasing, which in turn makes it difficult to enable on-device CNN inferences in resource-constrained edge devices. Though weight pruning and 5-bit quantization methods have shown promising results, it is still challenging to deploy large CNN models in edge devices. In this paper, we propose an encoding and hardware-based decoding technique which can be applied to 5-bit quantized weight data for on-device CNN inferences in resource-constrained edge devices. Given 5-bit quantized weight data, we employ arithmetic coding with range scaling for lossless weight compression, which is performed offline. When executing on-device inferences with underlying CNN accelerators, our hardware decoder enables a fast in-situ weight decompression with small latency overhead. According to our evaluation results with five widely used CNN models, our arithmetic coding-based encoding method applied to 5-bit quantized weights shows a better compression ratio by9.6×while also reducing the memory data transfer energy consumption by 89.2%, on average, as compared to the case of uncompressed 32-bit floating-point weights. When applying our technique to pruned weights, we obtain better compression ratios by57.5×–112.2×while reducing energy consumption by 98.3%–99.1% as compared to the case of 32-bit floating-point weights. In addition, by pipelining the weight decoding and transfer with the CNN execution, the latency overhead of our weight decoding with 16 decoding unit (DU) hardware is only 0.16%–5.48% and 0.16%–0.91% for non-pruned and pruned weights, respectively. Moreover, our proposed technique with 4-DU decoder hardware reduces system-level energy consumption by 1.1%–9.3%."
  },
  {
    "year": "2021",
    "abstract": "Semantic segmentation annotation helps train computer vision based Artificial Intelligence models where each image pixel is assigned to a specific object class. The model developers try to identify the features helpful for determining the objects of interest by using various supervised deep learning techniques. However, this is a difficult task due to the complexity of object structures. Two difficulties arise in the current approaches for semantic segmentation. The pixel-wise label approach is costly to obtain and is time consuming. Second, the datasets taken for the semantic segmentation task are not balanced since certain classes are present more than the others. This biases the model performance to the most represented ones. We propose a new reinforced active learning strategy based on a deep reinforcement learning algorithm. This work presents a modified DeepQLearning formulation for active learning. An agent learns the strategy of selecting a subset of small image regions, which are more knowledgeable than the whole set of images from an unlabeled data pool. The decision on the area of selection is dependent on the assumptions and segmentation model uncertainties taken for training purposes. We use the CamVid and RGB indoor test scenes dataset to evaluate the proof of concept. Our results infer that our approach demands more labels from under-represented groups than the baselines, thus enhancing their efficiency and mitigating the class imbalance. Our method’s performance is superior to the conventional deep learning models in detecting 8 out of 11 classes on the Camvid road segmentation scene dataset. It achieves an accuracy of 90.56%, a mIoU score of 87.17%, and a BF score of 93.14%. On the SUNRGB indoor scenes dataset, it gives an accuracy of around 75.82% and a BF score of 77.25%, thus outperforming the current state-of-the-art methods."
  },
  {
    "year": "2021",
    "abstract": "A compliance illusion can be created if vibration bursts, called friction grains, are provided in response to changes in pressing force on a surface. This method has been used in many human-computer interaction applications. For instance, it can enrich virtual controls on a hand-held device with compliant feeling. However, one of the limitations of this method is that the friction grains that it uses feel “bumpy” and “buzzing,” which may pose a hurdle to the adoption of the method by consumer products where the affective quality of tactile feedback is important. To overcome this limitation, we examined an alternative compliance illusion method, which computes the time derivative of the force applied by the user, and uses it to modulate a base vibration signal. We conducted a magnitude estimation experiment and showed that the alternative method with a sinusoidal base vibration signal can create significantly less bumpy, less buzzing, and thereby less unpleasant tactile feedback compared with the grain-based method while achieving the same level of compliance illusion effect as the grain-based method."
  },
  {
    "year": "2021",
    "abstract": "In this paper, we propose a cloud-based big data processing approach to evaluate the flexibility potential of commercial buildings by type and benefits for the owners. The pandemic times changed electricity consumption patterns with a substantial impact on energy markets. Many activities moved from large commercial offices and schools to residential buildings. With machine learning algorithms, the flexibility forecast can be improved to help energy suppliers, grid operators, and traders better calculate the flexibility potential of commercial buildings. With better forecasts, grid operators can identify and mitigate risks, prevent malfunctions, and schedule maintenance works in advance. Using flexibility forecast as input and results from previous studies regarding flexibility coefficient by state and demand response programs, we propose an original method to assess load flexibility of commercial buildings and calculate the benefits for their owner. The exemplification is done with an extensive hourly dataset from the U.S.A. of 14,976 comma-separated values files with a total of 131.18 million records showcasing the electricity and gas consumptions and their breakdown for one year."
  },
  {
    "year": "2021",
    "abstract": "The number of applications that run over mobile networks, expecting bounded end-to-end delay, is increasing steadily. However, the stochastic and shared nature of the wireless medium makes providing such guarantees challenging. Using several network interfaces simultaneously can help address fluctuating delays, provided that transport protocols can switch between them in a timely manner. Today’s protocols are mostly closed-loop and thus require at least one round trip before reacting to increased delay. This paper examines whether jumps in round trip times (RTTs) have a pattern that can be predicted beforehand. Using per second RTT measurements from hundreds of probes in two Long Term Evolution (LTE) cellular networks, we train an ensemble of classifiers to detect increases in delay. We construct a parsimonious explainable model that provides an accuracy of 80% and does not appear to be specific to a particular mobile operator. Further, we examine whether our model can be extended to 5G using a small dataset with extra 5G metadata, resulting in an accuracy of 88%. Our model indicates that RTTs are long-range correlated and shows that radio measurements of channel occupancy are accurate predictors of the onset of high delays. These results suggest that it is feasible to build an open-loop control system for multiplexing among several interfaces to proactively bound delays."
  },
  {
    "year": "2021",
    "abstract": "Si-based electrolyte-gated transistors (EGTs) have been investigated to achieve high sensitivity and a low detection limit (LOD). Here, a lumped-capacitive model was applied to analyze the influence of receptor–target conjugates on the sensing performance. The voltage-related sensitivity is mainly determined by the effective dipole potential (VDP,EFF), the effective capacitance of the functionalization layer (CFN,EFF), and the total charge density in the channel (QS) related to the operating regime. In an n-type EGT, the sensitivity is enhanced as the device is operated in the subthreshold regime with a positiveVDP,EFFand a smallCFN,EFF. The influence of theVDP,EFFandCFN,EFFwas experimentally evaluated by detecting the peanut allergen (PA) using the fabricated n-type Si-EGTs. A higher sensitivity and a lower LOD could be achieved in the subthreshold regimes than in the linear regime. These results suggest that the proposed model is very useful to optimize the sensing characteristics of Si-based EGT for biosensing applications."
  },
  {
    "year": "2021",
    "abstract": "Network-on-chip (NoC) has become the mainstream fabric architecture for chip multiprocessor (CMP) design. Owing to the market-driven advancement of modern applications in CMP, multicast traffic is aggressively increasing to support barrier synchronization, multithreading, and cache coherence protocols. Although multicast by branching of packets in the NoC router facilitates shortest path routing, additional branching-induced deadlocks must be circumvented. Existing NoC studies on deadlock-free minimal path routing in multicast traffic have typically deployed additional virtual channels or large buffers to hold entire packets, thereby significantly increasing the router area. Focusing on the area-efficient solution while sustaining the performance, we propose a novel multicast router using buffer sharing (MRBS) to guarantee deadlock-free multicast routing by exploiting the spatial diversity of the input buffer. MRBS ensures minimal path routing without requiring additional virtual channels or large buffers to hold entire packets. Extensive experiments were conducted by varying the buffer, packet, and network sizes, as well as the number of destinations per packet, under random multicast traffic with diverse injection rates. Simulation results show that MRBS achieves a 39.3 % improvement in the area-delay product on average for various network sizes compared to the conventional tree-based router."
  },
  {
    "year": "2021",
    "abstract": "The number of road accidents has constantly been increasing recently around the world. As per the national highway traffic safety administration’s investigation, 45% of vehicle crashes are done by a distracted driver right around each. We endeavor to build a precise and robust framework for distinguishing diverted drivers. The existing work of distracted driver detection is concerned with a limited set of distractions (mainly cell phone usage). This paper uses the first publicly accessible dataset that is the state farm distracted driver detection dataset, which contains eight classes: calling, texting, everyday driving, operating on radio, inactiveness, talking to a passenger, looking behind, and drinking performed by 26 subjects to prepare our proposed model. The transfer values of the pertained model EfficientNet are used, as it is the backbone of EfficientDet. In contrast, the EfficientDet model detects the objects involved in these distracting activities and the region of interest of the body parts from the images to make predictions strong and accomplish state-of-art results. Also, in the Efficientdet model, we implement five variants: Efficientdet (D0-D4) for detection purposes and compared the best Efficientdet version with Faster R-CNN and Yolo-V3. Experimental results show that the proposed approach outperforms earlier methods in the literature and conclude that EfficientDet-D3 is the best model for detecting distracted drivers as it achieves Mean Average Precision (MAP) of 99.16% with parameter setting: learning rate ofle−3, 50 epoch, batch size of 4, and step size of 250, demonstrating that it can potentially help drivers maintain safe driving habits."
  },
  {
    "year": "2021",
    "abstract": "Since the Internet of Robotic Things (IoRT) is composed of robots with actuators, interferences with the real-world activities are necessary, and safety is essential. In addition, some IoRT services may require bidirectional communication between multiple machines. One of the communication protocols that satisfy these requirements is AMQP, a broker architecture that emphasizes reliability and high functionality in communication. Therefore, using AMQP as the communication infrastructure between components in an IoRT system, it can contribute to improving the reliability of robot operations in IoRT and diversifying messaging between robots. To verify AMQP’s communication advantages, we have implemented the communication interface of AMQP in RT-Middleware, which is one of the robot middlewares, and have conducted performance and reliability tests on the effectiveness of RT-Middleware as a platform for constructing a reliable IoRT system. In the tests, we compared the communication performance of the platform with CORBA and MQTT communication interfaces implemented in RT-Middleware. The results show that although AMQP causes a small amount of latency compared to other communication interfaces, the distribution range of the latency is small, and relatively stable communication is performed. Furthermore, in the messaging quality test results, the data loss during communication by AMQP is almost a hundred times better than CORBA, and ten times better than MQTT, which mean that highly reliable messaging is possible. Based on this study’s findings, we conclude that AMQP should be fully used as a communication protocol for constructing IoRT systems."
  },
  {
    "year": "2021",
    "abstract": "Product recall management in the automotive industry is a challenging problem that affects human lives and the safe operation of automobiles. Product recalls can assist in removing potentially unsafe products from the marketplace and minimizing a company’s responsibility for corporate negligence. Today’s systems and technologies leveraged for product recall management in the automotive supply chain fall short in providing transparency, traceability, reliability, audit, security, and trust features. In this paper, we propose a blockchain-based approach to overcome the aforementioned problems related to product recall management. We employ the public Ethereum blockchain and integrate it with the decentralized storage of the InterPlanetary File System (IPFS) to deal with the large-sized data problem. We present the system design and six algorithms explaining the working principles, information exchange flow, and stakeholders’ detail and their sequential interactions. We discuss the implementation details, generalization aspects, and cost and security analyses to evaluate the performance of the proposed approach. The proposed solution is cost-effective, secure, and enables automakers to have end-to-end visibility of information during product recalls. We make the smart contracts’ code publicly available on GitHub."
  },
  {
    "year": "2021",
    "abstract": "A biomedical implant (BMI) is a device that allows patients to monitor their health condition at any time and obtain care from any location. However, the functionality of these devices is limited because of their restricted battery capacity, such that a BMI may not attain its full potential. Wireless power transfer technology–based magnetic resonant coupling (WPT–MRC) is considered a promising solution to the problem of restricted battery capacity in BMIs. In this paper, spider web coil–MRC (SWC-MRC) was designed and practically implemented to overcome the restricted battery life in low–power BMIs. A series/parallel (S/P) topology for powering the BMI was proposed in the design of the SWC-MRC. Several experiments were conducted in the lab to investigate the performance of the SWC-MRC system in terms of DC output voltage, power transfer, and transfer efficiency at different resistive loads and distances. The experimental results of the SWC-MRC test revealed that when the Vsourceis 30 V, the DC output voltage of 5 V can be obtained at 1 cm. At such a distance (i.e., 1 cm), the SWC-MRC transfer efficiency is 91.86% and 97.91%, and the power transfer is 13.26 W and 23.5 W when 50- and 100-Ωresistive loads were adopted, respectively. A power transfer of 12.42 W and transfer efficiency of 93.38% were achieved at 2 cm for when a 150-Ωresistive load and a Vsourceof 35 V were considered. The achieved performance was adequate for charging some BMIs, such as a pacemaker."
  },
  {
    "year": "2021",
    "abstract": "Deliberate amplitude clipping is a simple and well-known technique to reduce the peak-to-average power ratio of orthogonal frequency division multiplexing (OFDM) systems. In this paper, we propose a clipping technique for peak power reduction in orbital angular momentum (OAM) multiplexing systems with uniform circular array (UCA) antennas. In the proposed technique, clipping is performed on digital baseband signals prior to OAM beamforming and pulse-shaping filtering, which helps to avoid out-of-band radiation and affecting the orthogonality of the OAM modes. In addition, an iterative distortion recovery algorithm is proposed in order to mitigate performance degradation in bit error rate (BER) due to the clipping. The algorithm is derived by unfolding the clipping noise cancellation (CNC) algorithm for OFDM systems into layers and by introducing layer-wise learnable parameters. Simulation results show that for a realistic OAM multiplexing system with 256QAM signaling, the unfolded CNC exhibits excellent BER performance even when the conventional CNC suffers from a high error-floor. The combination of the proposed clipping and distortion recovery schemes provides a significant reduction in the peak power of the OAM signals at the cost of only a slight degradation in BER performance."
  },
  {
    "year": "2021",
    "abstract": "In this paper, we present a 5.8 GHz radio-frequency (RF) wireless power transfer (WPT) system that consists of 64 transmit antennas and 16 receive antennas. Unlike the inductive or resonant coupling-based near-field WPT, RF WPT has a great advantage in powering low-power internet of things (IoT) devices with its capability of long-range wireless power transfer. We also propose a beam scanning algorithm that can effectively transfer the power no matter whether the receiver is located in the radiative near-field zone or far-field zone. The proposed beam scanning algorithm is verified with a real-life WPT testbed implemented by ourselves. By experiments, we confirm that the implemented 5.8 GHz RF WPT system is able to transfer 3.67 mW at a distance of 25 meters with the proposed beam scanning algorithm. Moreover, with the proposed beam scanning algorithm, the power transfer efficiency reaches 20.32 % and 0.24 % at distances of 0.5 and 5 meters, respectively, whereas the far-field-only-scanning scheme achieved the transfer efficiencies of 13.45 % and 0.23 % at the same receiver positions. Since the proposed transmit antenna array has the maximum linear dimension of 299.12 mm, the approximate boundary between far-field and radiative near-field is 3.45 meters based on the Fraunhofer distance calculation. The results show that the proposed algorithm can effectively cover radiative near-field region differently from the conventional scanning schemes which are designed under the assumption of the far-field WPT."
  },
  {
    "year": "2021",
    "abstract": "Deep learning-based salient object detection (SOD) methods have made great progress in recent years. However, most deep learning-based methods suffer from coarse object boundaries and expensive computations, especially in detecting objects with complex shapes. This paper presents an accurate and efficient SOD method that is based on a novel double-branch network that includes a body branch and an edge branch. To obtain an accurate edge, an edge profile enhancement module (EPEM) is embedded in the edge branch. In addition, a fusion feedback module (FFM) is embedded to integrate features from the two branches. To address the problem of expensive computations, channel attention module (CAM) is included to restrain redundant feature channels. Thus, the speed of the inference step can be improved with little reduction in the boundary accuracy. Experimental results on 9 datasets demonstrate that the proposed method performs favorably against 8 state-of-the-art methods in terms of both accuracy and efficiency. Additionally, our method achieves excellent detection results for objects with complex shapes."
  },
  {
    "year": "2021",
    "abstract": "Wear debris generated in a pitting process of planetary gearboxes carries valuable information about health status. However, RGB images of online wear debris are often affected by image blur caused by Gaussian noise, high-frequency noise, and other random noises besides Gaussian noise, including bubbles in lubricating oil, dark oil caused by contamination, and the temperature rise of electronic components. To address these issues, in this work, an image denoising model WVBOD was proposed based on the fusion of wavelet, variational mode decomposition and non-local mean filtering, which makes full use of the advantages of above three denoising methods, removes the noise in the image and preserves the details of the image information. Comparing the peak signal-to-noise ratio and structural similarity of the denoised image using different models, the WVBOD objectively acquired better denoising result than other advanced denoising methods. In addition, the previous online wear debris features mainly focus on using changes in particle concentration to reveal the deterioration of the wear state. Based on the fact that the quantity of large wear debris increases with the evolution of gear pitting, a novel wear indexZ(i), representing the size gradient of large wear debris and sensitive to an increase in large wear debris, is proposed for the denoising image. Then early fault warning can be realized for the planetary gearbox. Finally, it is verified by the size and quantity features extracted by using offline oil analysis techniques."
  },
  {
    "year": "2021",
    "abstract": "Rim electromagnetic direct-driven propeller (REDP) is a propeller used in the underwater vehicle. It has many merits compared with the traditional propeller. It is difficult to utilize the sensor to get the rotor position and speed that are important to control REDP. An observer based on sliding mode method was proposed to estimate the rotor position and speed in the paper. Its stability was proved and some parameters were obtained. The influence of the switching function on the observation performance was analyzed and the sigmoid function was chosen as the switching function of the sliding mode observer. Then the observation position and speed were analyzed under different parameters to get the better observation performance. Finally, the experiment verified the feasibility of sliding mode observer."
  },
  {
    "year": "2021",
    "abstract": "In this tutorial paper, we systematically present the fundamental operating principles and analytical details of the discrete Fourier transform based signal processing techniques for the TDM MIMO FMCW millimeter-wave (mmWave) automotive radars. The mmWave radars provide a key sensing capability to support safety features of the conventional and autonomous vehicles. Automotive radar sensors are used to detect presence and location of the objects of interest to derive comprehensive and accurate knowledge of road conditions and surrounding environments. Automotive radars are subjected to an increasing demand to provide high-resolution measurements in the range-Doppler-azimuth-elevation domains. Therefore, the current state-of-the-art automotive radars commonly employ MIMO technologies, resulting in a large block of multidimensional data to process in real time through a long chain of signal processing algorithms. Detailed coverage on the fundamental radar signal processing techniques are scattered in a large body of literature for classical radar systems. Currently, there is no tutorial available that covers the technical details of the latest TDM MIMO FMCW radar technology, making it extremely hard for new researchers in the field of automotive mmWave radars. This paper contains sufficient technical details to serve as a tutorial. It can help lay a solid analytical foundation to facilitate exploration and development of advanced radar signal processing techniques for automotive applications. The algorithmic details and analytical results presented in this paper can be readily applied to both real-time implementation and post-processing. Simulation and experimental results are presented in this paper to validate analytical derivations and to demonstrate the capabilities of the TDM MIMO radar sensor in practical implementations."
  },
  {
    "year": "2021",
    "abstract": "Quantum cryptography is a promising technology that achieves unconditional security, which is essential to a wide range of sensitive applications. In contrast to optical fiber, the free-space optical (FSO) link is efficiently used as a quantum channel without affecting the polarization of transmitted photons. However, the FSO link has several impairments, such as atmospheric turbulence and pointing errors, which affect the performance of the quantum channel. This paper proposes a quantum key distribution (QKD) scheme that uses a time-bin entanglement protocol over the FSO channel that suffers from various channel impairments. Due to the interest in unmanned aerial vehicles (UAVs) and their usefulness for many social, internet-of-things (IoT), civil, and military applications, the proposed QKD-FSO system is integrated with the ground-to-UAV platform. Furthermore, variances in the position and orientation of the UAV are investigated using a tracking system. These variances are considered when evaluating the overall performance of the proposed integrated system. For this purpose, closed-form expressions are obtained for the system average symbol error rate (ASER) and outage probability. The Monte Carlo simulation is used to verify the validity of the proposed expressions. The system security is investigated assuming photon number splitting (PNS) attack. Moreover, the transmit power, time-bin number, and modulation order are optimized to maximize the raw and secret key rates. The results show that for 500 m link, ASER<10−1and link outage probability<10−1with tolerating boresight displacement up to 30 cm, the system should be configured at receiver’s field-of-view>22mrad and signal-to-noise ratio>7.5dB which leads SNRth<2.5dB and raw key rate maximized by adjusting the number of time bins according to the received SNR."
  },
  {
    "year": "2021",
    "abstract": "Federated learning (FL) is a distributed machine learning paradigm in which multiple clients collaboratively learn a global model without sharing local training data. This study presents an adaptive model selection algorithm to enhance existing aggregation for FL. The proposed method uses sparsely learned local models and adaptively selects the best models based on the entropy-inspired information using the neural nodes of fully connected layers. This enables substantial nodes to be included in federated averaging (FedAvg), unlike standard FedAvg. In the case of a client model (at an embedded edge cluster), we exploited sparse learning to absorb more features associated with new classes by retraining weak neural nodes. For global model averaging, we used the proposed model selection technique to enhance the performance of traditional FedAvg by up to 20% in terms of global accuracy in the same number of rounds, which, in turn, has increased the convergence in federated rounds. For local sparse learning models, we simulated clients at edge clusters using the Docker container on embedded boards (NVIDIA Jetson Series). To ensure the efficacy of our proposed technique, we rigorously tested our algorithm on various datasets (CIFAR 10, MNIST, OCS lab(driving), UCI-HAR) using different models for image classification (EfficientNet, MobileNetv2, ResNet18) and time-series classification (FCN-LSTM, DepthConv-LSTM), and compared our algorithm with several state-of-the-art methods, such as FedAvg and FedFS. The proposed method outperformed the others in terms of generalizability and assists in converging earlier than existing algorithms in federated rounds."
  },
  {
    "year": "2021",
    "abstract": "In this survey, we look at the overall idea of Remotely Piloted Aircraft Systems (RPAS) and autonomous control, as well as RPAS infrastructure, levels of autonomy, and current benefits and difficulties in the field when utilizing Artificial Intelligence. While current remotely piloted aircraft systems have a manual pilot operator to provide double-layer security and safety, studies show that having RPAS with a fully autonomous vehicle at its centre could significantly improve decision-making and overall mission precision, accuracy, safety, and efficiency."
  },
  {
    "year": "2021",
    "abstract": "Entanglement assisted (EA) communication has been advocated by numerous authors as a potential alternative to classical communications, in particular in noisy and low-brightness regime. In this paper, I propose an EA scheme employing the optical phase-conjugation (OPC) on transmitter side. I show that the proposed EA communication system, with the transmitter side OPC, significantly outperforms its classical counterpart in low-brightness and highly noisy regime, while employing a classical coherent detection scheme for two-dimensional demodulation. Moreover, the capacity of the proposed EA scheme is significantly higher than EA repetition-BPSK, homodyne, heterodyne, and Holevo capacities. Finally, the proposed EA scheme outperforms the corresponding EA scheme with OPC placed on a receiver side."
  },
  {
    "year": "2021",
    "abstract": "In this paper, we propose an extended permanent magnet synchronous motor model that incorporates a quadratic flux-current function to determine the polarity-dependent saliency and develop a sensorless initial position detection method that is capable of polarity detection. The quadratic model extension is based on the second-order Taylor polynomial of the flux-current function. We present the model equations in both the stator- and the rotor-oriented reference frames as well as the Park and inverse Park transforms of the quadratic terms and Hessian matrices. The transient behavior and the dependency of the extended model on the rotor position have been validated. The proposed initial position detection method injects non-modulated even square wave voltage signals and relies only on phase-current measurements. We analyzed the effect of the pulse length on the errors of the position estimation and polarity detection. We provide machine parameter-based approximations of the current components dependent on the rotor position and, based on them, present a quantitative pulse-length design method."
  }
]